# JoistSystemNewBeamTypeNoFamNameParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..JoistSystemNewBeamTypeNoFamNameParam Property
ParameterTypeId Class See Also
---
"Beam Type (No Family Name)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId JoistSystemNewBeamTypeNoFamNameParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JoistSystemNewBeamTypeNoFamNameParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JoistSystemNewBeamTypeNoFamNameParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace